package com.unichain.pay.channel.mfe88.demo.entity;

import java.util.ArrayList;
import java.util.List;

public enum RespCode {
    _A0("10000", "受理、提交成功"),//支付订单
    _A1("10001", "订单处理中"),
    _DS01("90001", "订单失败"),//代付查询
    _DS02("10000", "订单成功"),//代付查询
    _03("90003", "商户账户已冻结"),//通用code
    _04("90004", "sign验签失败"),
    _05("90005", "传入参数错误（参数错误，有必传参数为空）"),
    _06("90006", "商户未开通此接口，开通后才能使用"),
    _07("90007", "接口不支持商户提交的service"),
    _08("90008", "系统繁忙，请稍后再试"),
    _09("90010", "商户未开通该产品的支付功能"),
    _10("20001", "订单重复提交，请检查商户订单号"),
    _11("90001", "系统异常"),
    _12("90002", "商户账户不存在"),//upp
    _13("20012", "未查询到订单"),
    _14("32001", "没有开通"),
    _16("20033", "银行或通道系统异常"),
    //绑卡
    upp4("9000", "参数异常，机构号ID异常"),
    upp6("9000", "手机号不正确"),
    upp7("9000", "手机号不能为空"),
    upp8("9000", "持卡人姓名不能为空"),
    upp9("9000", "银行卡绑定身份证不能为空"),
    upp10("9000", "贷记卡CVV必须传"),
    upp11("9000", "贷记卡有效期不能为空,格式：月月年年"),
    upp12("9000", "银行四要素不匹配，请检查"),
    upp13("20033", "绑卡异常！"),
    upp14("0000", "绑卡成功"),
    upp15("10001", "签约成功，需短信确认！"),
    upp17("90001", "系统异常"),
    //实名认证
    upp18("9000", "验签失败"),
    upp19("20012", "未查询到用户"),
    upp20("31003", "该用户已经实名认证"),
    upp21("10000", "认证成功"),
    upp22("90000", "认证失败"),
    upp24("9000", "系统异常"),
    //快捷
    upp25("9000", "当前机构不可用于普通支付"),
    upp26("9000", "支付金额精度最多支持到小数点后2位"),
    upp27("9000", "参数异常，请输入交易密码"),
    upp28("9000", "当前用户不存在，请检查用户id！"),
    upp29("9000", "支付密码未设置，请先设置支付密码"),
    upp30("9000", "支付密码输入错误"),
    upp31("9000", "银行卡为空"),
    upp32("9000", "未找到银行卡[NOT_USER]"),
    upp33("9000", "银行卡未签约"),
    upp34("9000", "充值无法使用信用卡"),
    upp36("10000", "支付中"),
    //代付
    upp48("32001", "没有开通,请联系客服"),
    upp49("10000", "支付成功"),

    //转账
    upp50("50001", "系统异常"),
    upp52("32001", "没有开通,请联系客服"),
    upp53("9000", "出金用户不存在，请检查用户id！"),
    upp54("9000", "转账金额精度最多支持到小数点后2位"),
    upp55("30001", "无法对自己发起转账操作"),
    upp56("30001", "出金用户余额不足，请重新选择支付方式"),

    upp37("90010", "未授权开通的产品"),
    upp38("90001", "快捷支付申请接口错误..."),
    upp39("90005", "参数错误e1"),
    upp40("90001", "没有合适的通道账户"),
    upp41("90011", "通道不支持的产品或设置不正确"),
    upp42("90010", "通道账号设置有误，未找到私钥，请联系客服"),
    upp43("90010", "通道账号设置有误，请联系客服"),
    upp44("90005", "签约身份证号码不正确"),
    upp45("90005", "签约手机号码不正确"),
    upp46("90001", "订单未能通过校验,请联系客服");

    String desc;
    String code;

    RespCode(String code, String des) {
        this.code = code;
        this.desc = des;
    }

    public static List<RespCode> getCode(String code) {
        if (code == null || code.isEmpty())
            return null;
        List<RespCode> result = new ArrayList<>();
        RespCode[] values = RespCode.values();
        for (RespCode value : values) {
            if (code != null && code.equals(value.code)) {
                result.add(value);
            }
        }
        return result;
    }

    @Override
    public String toString() {
        return getName(this) + code + "[" + desc + "]";
    }

    public String getName(RespCode r) {
        if (r == null)
            return null;
        if (r.name().contains("_A"))
            return "充值结果:";
        if (r.name().contains("_D0"))
            return "代付提交结果:";
        if (r.name().contains("_DS"))
            return "代付查询结果:";
        else
            return "通用结果:";
    }
}
